app/views/statuses/new.html.erb

SELECT "locations".* FROM "locations"
---
		<% # displays Location name as text, while mapping the title to its ID for submission %>
		<%= select( "status", "location_id", Location.all.collect { |loc| [loc.title, loc.id] }) %>