app/views/updates/new.html.erb

SELECT  "locations".* FROM "locations" ORDER BY "locations"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
	<% # displays Location name as text, while mapping the title to its ID for submission %>
	<%= select( "update", "location_id", Location.all.collect { |loc| [loc.title, loc.id] }) %>