app/controllers/alerts_controller.rb

	def index
		@alerts = Alert.all
---
SELECT "alerts".* FROM "alerts" ORDER BY created_at DESC

	def update
		if @alert.update(alert_params)
---
UPDATE "alerts" SET "status" = ?, "updated_at" = ? WHERE "alerts"."id" = ?  [["status", 1], ["updated_at", 2017-04-01 16:09:11 UTC], ["id", 1]]

	def set_alert
		@alert = Alert.find(params[:id])
---
SELECT  "alerts".* FROM "alerts" WHERE "alerts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]