app/controllers/api_locations_controller.rb

	def show
		location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def current
		this_one = Status.last
---
SELECT  "statuses".* FROM "statuses" ORDER BY "statuses"."id" DESC LIMIT ?  [["LIMIT", 1]]