app/controllers/buffalo_reports_controller.rb

	def index
		@reports = BuffaloReport.all
---
SELECT "buffalo_reports".* FROM "buffalo_reports"