app/controllers/locations_controller.rb

	def show
		@location = Location.find(params[:id])
		@updates = @location.updates.all.order('created_at DESC')
		@statuses = @location.statuses.all.order('created_at DESC')
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "updates".* FROM "updates" WHERE "updates"."location_id" = ? ORDER BY created_at DESC  [["location_id", 1]]
SELECT "statuses".* FROM "statuses" WHERE "statuses"."location_id" = ? ORDER BY created_at DESC  [["location_id", 1]]

	def update
		@location = Location.find(params[:id])

		if @location.update(allowed_params)
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "locations" SET "stream_class" = ?, "quality_issues" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["stream_class", "A good one."], ["quality_issues", "A bad one."], ["updated_at", 2017-03-11 18:31:13 UTC], ["id", 1]]

	def create
		@location = Location.new(allowed_params)

		if @location.save
---
INSERT INTO "locations" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "SUNY at Buffalo North Campus"], ["description", "Home of Davis Hall and CSE"], ["created_at", 2017-03-05 03:00:20 UTC], ["updated_at", 2017-03-05 03:00:20 UTC]]