app/controllers/reports_controller.rb

  def index
		@reports = Report.all.order("created_at DESC")
---
SELECT "reports".* FROM "reports" ORDER BY created_at DESC

  def update
		if @report.update(alert_params)
---
UPDATE "reports" SET "status" = ?, "updated_at" = ? WHERE "reports"."id" = ?  [["status", 3], ["updated_at", 2017-04-09 23:00:30 UTC], ["id", 3]]