app/controllers/sessions_controller.rb

  def create
    # Signs a user in only if their credentials are good and they authenticate
    @user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]