app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("o2", "conductivity", "pH", "turbidity", "temp", "created_at", "updated_at", "user_id", "location_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["o2", 4], ["conductivity", 4], ["pH", 4], ["turbidity", 4], ["temp", 4], ["created_at", 2017-03-09 20:11:19 UTC], ["updated_at", 2017-03-09 20:11:19 UTC], ["user_id", 104], ["location_id", 1]]
---
	def create
		@user = current_user
		@status = Status.new(allowed_params)
		@status.user_id = current_user.id

		if @status.save