app/controllers/updates_controller.rb

	def new
		@update = Update.new
		#@update.user_id = current_user.id

		# make locations IDs available to select in the form
		locations = Location.select(:id).distinct
		@locations_list = []
		locations.each do |loc|
---
SELECT  DISTINCT "locations"."id" FROM "locations" ORDER BY "locations"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "locations".* FROM "locations" ORDER BY "locations"."id" ASC LIMIT ?  [["LIMIT", 1]]

	def create
		locations = Location.select(:id).distinct
		@locations_list = []
		locations.each do |loc|
			@locations_list << loc.id
		end

		@user = current_user
		@update = Update.new(allowed_params)
		@update.user_id = current_user.id

		if @update.save
---
SELECT DISTINCT "locations"."id" FROM "locations"
INSERT INTO "updates" ("lead", "mercury", "plutonium", "created_at", "updated_at", "location_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["lead", 1.11], ["mercury", 1.11], ["plutonium", 1.11], ["created_at", 2017-03-07 19:51:58 UTC], ["updated_at", 2017-03-07 19:51:58 UTC], ["location_id", 1], ["user_id", 104]]

	def show
		@update = Update.find(params[:id])
---
SELECT  "updates".* FROM "updates" WHERE "updates"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]