app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    # Now we're using pagination. will_paginate will return users from the
    # database in chunks and display them on a page with links to other pages
    @users = User.paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$Wsw8OC5oU86s04XUERIRnOn8hU1Dg98WRLgehVH7y9cX8/ONGIkkO"], ["admin", true], ["updated_at", 2016-08-12 14:40:56 UTC], ["id", 950961012]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)